================================================================================
C clef position 1
================================================================================
name: test;
%%
(c1)
--------------------------------------------------------------------------------

(source_file
  (header_section
    (header
      (header_generic
      name: (header_name))))
  (section_separator)
  (notation_section
    (notation_item
      (note_group
        (snippet_list
          (gabc_snippet
            (gabc_clef
              name: (c_clef))))))))

================================================================================
C clef position 2
================================================================================
name: test;
%%
(c2)
--------------------------------------------------------------------------------

(source_file
  (header_section
    (header
      (header_generic
      name: (header_name))))
  (section_separator)
  (notation_section
    (notation_item
      (note_group
        (snippet_list
          (gabc_snippet
            (gabc_clef
              name: (c_clef))))))))

================================================================================
C clef position 3
================================================================================
name: test;
%%
(c3)
--------------------------------------------------------------------------------

(source_file
  (header_section
    (header
      (header_generic
      name: (header_name))))
  (section_separator)
  (notation_section
    (notation_item
      (note_group
        (snippet_list
          (gabc_snippet
            (gabc_clef
              name: (c_clef))))))))

================================================================================
C clef position 4
================================================================================
name: test;
%%
(c4)
--------------------------------------------------------------------------------

(source_file
  (header_section
    (header
      (header_generic
      name: (header_name))))
  (section_separator)
  (notation_section
    (notation_item
      (note_group
        (snippet_list
          (gabc_snippet
            (gabc_clef
              name: (c_clef))))))))

================================================================================
F clef position 1
================================================================================
name: test;
%%
(f1)
--------------------------------------------------------------------------------

(source_file
  (header_section
    (header
      (header_generic
      name: (header_name))))
  (section_separator)
  (notation_section
    (notation_item
      (note_group
        (snippet_list
          (gabc_snippet
            (gabc_clef
              name: (f_clef))))))))

================================================================================
F clef position 2
================================================================================
name: test;
%%
(f2)
--------------------------------------------------------------------------------

(source_file
  (header_section
    (header
      (header_generic
      name: (header_name))))
  (section_separator)
  (notation_section
    (notation_item
      (note_group
        (snippet_list
          (gabc_snippet
            (gabc_clef
              name: (f_clef))))))))

================================================================================
F clef position 3
================================================================================
name: test;
%%
(f3)
--------------------------------------------------------------------------------

(source_file
  (header_section
    (header
      (header_generic
      name: (header_name))))
  (section_separator)
  (notation_section
    (notation_item
      (note_group
        (snippet_list
          (gabc_snippet
            (gabc_clef
              name: (f_clef))))))))

================================================================================
F clef position 4
================================================================================
name: test;
%%
(f4)
--------------------------------------------------------------------------------

(source_file
  (header_section
    (header
      (header_generic
      name: (header_name))))
  (section_separator)
  (notation_section
    (notation_item
      (note_group
        (snippet_list
          (gabc_snippet
            (gabc_clef
              name: (f_clef))))))))

================================================================================
C clef with flat position 1
================================================================================
name: test;
%%
(cb1)
--------------------------------------------------------------------------------

(source_file
  (header_section
    (header
      (header_generic
      name: (header_name))))
  (section_separator)
  (notation_section
    (notation_item
      (note_group
        (snippet_list
          (gabc_snippet
            (gabc_clef
              name: (c_clef_flat))))))))

================================================================================
C clef with flat position 2
================================================================================
name: test;
%%
(cb2)
--------------------------------------------------------------------------------

(source_file
  (header_section
    (header
      (header_generic
      name: (header_name))))
  (section_separator)
  (notation_section
    (notation_item
      (note_group
        (snippet_list
          (gabc_snippet
            (gabc_clef
              name: (c_clef_flat))))))))

================================================================================
C clef with flat position 3
================================================================================
name: test;
%%
(cb3)
--------------------------------------------------------------------------------

(source_file
  (header_section
    (header
      (header_generic
      name: (header_name))))
  (section_separator)
  (notation_section
    (notation_item
      (note_group
        (snippet_list
          (gabc_snippet
            (gabc_clef
              name: (c_clef_flat))))))))

================================================================================
C clef with flat position 4
================================================================================
name: test;
%%
(cb4)
--------------------------------------------------------------------------------

(source_file
  (header_section
    (header
      (header_generic
      name: (header_name))))
  (section_separator)
  (notation_section
    (notation_item
      (note_group
        (snippet_list
          (gabc_snippet
            (gabc_clef
              name: (c_clef_flat))))))))

================================================================================
Clef link: c2 to c4
================================================================================
name: test;
%%
(c2@c4)
--------------------------------------------------------------------------------

(source_file
  (header_section
    (header
      (header_generic
      name: (header_name))))
  (section_separator)
  (notation_section
    (notation_item
      (note_group
        (snippet_list
          (gabc_snippet
            (gabc_clef_link
              left: (gabc_clef
                name: (c_clef))
              right: (gabc_clef
                name: (c_clef)))))))))

================================================================================
Clef link: c2 to f2
================================================================================
name: test;
%%
(c2@f2)
--------------------------------------------------------------------------------

(source_file
  (header_section
    (header
      (header_generic
      name: (header_name))))
  (section_separator)
  (notation_section
    (notation_item
      (note_group
        (snippet_list
          (gabc_snippet
            (gabc_clef_link
              left: (gabc_clef
                name: (c_clef))
              right: (gabc_clef
                name: (f_clef)))))))))

================================================================================
Clef link: f3 to c4
================================================================================
name: test;
%%
(f3@c4)
--------------------------------------------------------------------------------

(source_file
  (header_section
    (header
      (header_generic
      name: (header_name))))
  (section_separator)
  (notation_section
    (notation_item
      (note_group
        (snippet_list
          (gabc_snippet
            (gabc_clef_link
              left: (gabc_clef
                name: (f_clef))
              right: (gabc_clef
                name: (c_clef)))))))))

================================================================================
Clef link: cb2 to c4
================================================================================
name: test;
%%
(cb2@c4)
--------------------------------------------------------------------------------

(source_file
  (header_section
    (header
      (header_generic
      name: (header_name))))
  (section_separator)
  (notation_section
    (notation_item
      (note_group
        (snippet_list
          (gabc_snippet
            (gabc_clef_link
              left: (gabc_clef
                name: (c_clef_flat))
              right: (gabc_clef
                name: (c_clef)))))))))

================================================================================
Clef link: triple link c1 to c2 to c3
================================================================================
name: test;
%%
(c1@c2@c3)
--------------------------------------------------------------------------------

(source_file
  (header_section
    (header
      (header_generic
      name: (header_name))))
  (section_separator)
  (notation_section
    (notation_item
      (note_group
        (snippet_list
          (gabc_snippet
            (gabc_clef_link
              left: (gabc_clef_link
                left: (gabc_clef
                  name: (c_clef))
                right: (gabc_clef
                  name: (c_clef)))
              right: (gabc_clef
                name: (c_clef)))))))))

================================================================================
Clef link with music before
================================================================================
name: test;
%%
(c4) a(c2@c4b)
--------------------------------------------------------------------------------

(source_file
  (header_section
    (header
      (header_generic
      name: (header_name))))
  (section_separator)
  (notation_section
    (notation_item
      (note_group
        (snippet_list
          (gabc_snippet
            (gabc_clef
              name: (c_clef))))))
    (notation_item
      (syllable
        (syllable_text))
      (note_group
        (snippet_list
          (gabc_snippet
            (gabc_clef_link
              left: (gabc_clef
                name: (c_clef))
              right: (gabc_clef
                name: (c_clef)))
            (gabc_neume
              pitch: (pitch_lowercase))))))))

================================================================================
Clef link with music after
================================================================================
name: test;
%%
a(c2@c4b) b(d)
--------------------------------------------------------------------------------

(source_file
  (header_section
    (header
      (header_generic
      name: (header_name))))
  (section_separator)
  (notation_section
    (notation_item
      (syllable
        (syllable_text))
      (note_group
        (snippet_list
          (gabc_snippet
            (gabc_clef_link
              left: (gabc_clef
                name: (c_clef))
              right: (gabc_clef
                name: (c_clef)))
            (gabc_neume
              pitch: (pitch_lowercase))))))
    (notation_item
      (syllable
        (syllable_text))
      (note_group
        (snippet_list
          (gabc_snippet
            (gabc_neume
              pitch: (pitch_lowercase))))))))

================================================================================
Mixed clef types in link: f to c to cb
================================================================================
name: test;
%%
(f2@c3@cb4)
--------------------------------------------------------------------------------

(source_file
  (header_section
    (header
      (header_generic
      name: (header_name))))
  (section_separator)
  (notation_section
    (notation_item
      (note_group
        (snippet_list
          (gabc_snippet
            (gabc_clef_link
              left: (gabc_clef_link
                left: (gabc_clef
                  name: (f_clef))
                right: (gabc_clef
                  name: (c_clef)))
              right: (gabc_clef
                name: (c_clef_flat)))))))))

================================================================================
Pitch c vs Clef c3: differentiating single note from clef
================================================================================
name: test;
%%
(c4) a(c) b(c3) c(f) d(f2)
--------------------------------------------------------------------------------

(source_file
  (header_section
    (header
      (header_generic
      name: (header_name))))
  (section_separator)
  (notation_section
    (notation_item
      (note_group
        (snippet_list
          (gabc_snippet
            (gabc_clef
              name: (c_clef))))))
    (notation_item
      (syllable
        (syllable_text))
      (note_group
        (snippet_list
          (gabc_snippet
            (gabc_neume
              pitch: (pitch_lowercase))))))
    (notation_item
      (syllable
        (syllable_text))
      (note_group
        (snippet_list
          (gabc_snippet
            (gabc_clef
              name: (c_clef))))))
    (notation_item
      (syllable
        (syllable_text))
      (note_group
        (snippet_list
          (gabc_snippet
            (gabc_neume
              pitch: (pitch_lowercase))))))
    (notation_item
      (syllable
        (syllable_text))
      (note_group
        (snippet_list
          (gabc_snippet
            (gabc_clef
              name: (f_clef))))))))
